In [4]:
import numpy as np 
import pandas as pd

## Data Frames

## **first_df , second_df , third_df , read_data**

In [4]:
arr = np.array([2,3,4,5])

In [5]:
arr

array([2, 3, 4, 5])

In [9]:
dict1 = {
    'Name':['Rustam' , 'Subh' , 'Harry'],
    'Marks' : [99 , 89 , 100],
    'City' : ['jaloun' , 'moon' , 'Rampur']
}

In [10]:
first_df = pd.DataFrame(dict1)

In [8]:
first_df

     Name  Marks    City
0  Rustam     99  jaloun
1    Subh     89    moon
2   Harry    100  Rampur

In [9]:
first_df.to_csv('write.csv')

In [10]:
Second_df = pd.DataFrame(dict1 , index=False)
Second_df

TypeError: Index(...) must be called with a collection of some kind, False was passed

In [ ]:
Second_df

In [ ]:
first_df.to_csv('write.csv' , index=False)

In [11]:
dict2 = {
    'Name':['Rustam' , 'Subh' , 'Harry' , 'Rahul'],
    'Marks' : [99 , 89 , 100 , 00],
    'City' : ['jaloun' , 'moon' , 'Rampur' , 'Lucknow']
}

In [12]:
Second_df = pd.DataFrame(dict2)

In [ ]:
Second_df

In [ ]:
Second_df.head(2)

In [ ]:
Second_df.tail(2)

In [ ]:
"Hello"

** Learning **

In [ ]:
Second_df.describe()

In [ ]:
Second_df

In [13]:
read_data = pd.read_csv('Friends.csv')

In [ ]:
read_data

In [ ]:
read_data.head(3)

In [ ]:
read_data.describe()

In [ ]:
read_data['Marks']

In [ ]:
read_data['Marks'][1]

In [ ]:
read_data['Marks'][1] = 88

In [ ]:
read_data

In [ ]:
read_data['Grade'][1] = 'B++'

In [ ]:
read_data

In [ ]:
read_data.update()

In [ ]:
read_data.to_csv('Friends.csv' , index=False)

In [ ]:
read_data.index = ['*' * len(read_data)]

In [ ]:
read_data

In [ ]:
read_data.index = ['*' , '*' , '*' , '*' , '*' , '*' ]

In [ ]:
read_data

In [ ]:
read_data.index = False

In [ ]:
read_data

In [ ]:
read_data.index = [None , None , None , None , None , None]

In [ ]:
read_data

In [ ]:
first_df

In [ ]:
Second_df

In [ ]:
read_data

In [ ]:
read_data.to_csv('Friends.csv' , index=False)

In [ ]:
read_data

In [ ]:
read_data = pd.read_csv('Friends.csv')

In [ ]:
read_data

In [ ]:
first_df

In [ ]:
Second_df

In [ ]:
read_data

In [14]:
third_df = read_data

In [ ]:
third_df

NameError: name 'third_df' is not defined

NameError: name 'read_data' is not defined

In [11]:
third_df

NameError: name 'third_df' is not defined

In [1]:
read_data

NameError: name 'read_data' is not defined

In [2]:
read_data

NameError: name 'read_data' is not defined

In [5]:
new_df = pd.read_csv('Friends.csv')

In [6]:
read_data

NameError: name 'read_data' is not defined

In [7]:
new_df

      Name Class  Marks Grade
0   Rustam   9th    100   A++
1   Kartik   9th     88   B++
2  Adhiraj   9th     89   B++
3   Muskan   9th      0     F
4    Rishi   9th     55     C
5    Rahul   8th     37     D

In [15]:
first_df

     Name  Marks    City
0  Rustam     99  jaloun
1    Subh     89    moon
2   Harry    100  Rampur

In [16]:
Second_df

     Name  Marks     City
0  Rustam     99   jaloun
1    Subh     89     moon
2   Harry    100   Rampur
3   Rahul      0  Lucknow

In [17]:
third

NameError: name 'third' is not defined

In [18]:
third_df

      Name Class  Marks Grade
0   Rustam   9th    100   A++
1   Kartik   9th     88   B++
2  Adhiraj   9th     89   B++
3   Muskan   9th      0     F
4    Rishi   9th     55     C
5    Rahul   8th     37     D

In [19]:
third_df.head(3)

      Name Class  Marks Grade
0   Rustam   9th    100   A++
1   Kartik   9th     88   B++
2  Adhiraj   9th     89   B++

In [20]:
third_df.tail(2)

    Name Class  Marks Grade
4  Rishi   9th     55     C
5  Rahul   8th     37     D

In [21]:
third_df

      Name Class  Marks Grade
0   Rustam   9th    100   A++
1   Kartik   9th     88   B++
2  Adhiraj   9th     89   B++
3   Muskan   9th      0     F
4    Rishi   9th     55     C
5    Rahul   8th     37     D

In [22]:
third_df.describe()

            Marks
count    6.000000
mean    61.500000
std     38.380985
min      0.000000
25%     41.500000
50%     71.500000
75%     88.750000
max    100.000000